## Pandas

In [1]:
import pandas as pd
import numpy as np

pd.__version__

'0.24.2'

In [5]:
data = pd.Series(np.arange(5,15))
data

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int32

In [6]:
data[2]

7

In [7]:
data[2:5]

2    7
3    8
4    9
dtype: int32

In [9]:
data = pd.Series([0.21,0.54,0.75,0.65], index=['a','b','c','d'])
data

a    0.21
b    0.54
c    0.75
d    0.65
dtype: float64

In [10]:
data['b']

0.54

In [13]:
data = pd.Series([0.21,0.54,0.75,0.65], index=[2.2,3.1,4,5])
data

2.2    0.21
3.1    0.54
4.0    0.75
5.0    0.65
dtype: float64

In [14]:
data[2:4]

2.2    0.21
3.1    0.54
4.0    0.75
dtype: float64

In [16]:
pop = {'H':[1,2], 'I':[2,3], 'T':[6,2], 'E':[5,8], 'S':[5.6,1]}
pop
pd.Series(pop)

H      [1, 2]
I      [2, 3]
T      [6, 2]
E      [5, 8]
S    [5.6, 1]
dtype: object

In [18]:
pop['I']

[2, 3]

In [19]:
pop['I':'E']

TypeError: unhashable type: 'slice'

In [42]:
name = {'Hitesh': 'Bhandup', 'Sagar': 'Kalewadi', 'Shreyashi':'Dombivali', 'Pukraj':'Rajasthan'}
age = {'Hitesh': 23, 'Sagar': 21, 'Taral':22, 'Pukraj':27}
pd.DataFrame({'name': name,'age': age})

                name   age
Hitesh       Bhandup  23.0
Pukraj     Rajasthan  27.0
Sagar       Kalewadi  21.0
Shreyashi  Dombivali   NaN
Taral            NaN  22.0

In [25]:
pd.DataFrame(np.random.rand(3,3), columns=['Foo','Bar','Ant'], index=['a','b','c'])

        Foo       Bar       Ant
a  0.492552  0.737428  0.604930
b  0.956319  0.755726  0.244243
c  0.765136  0.019474  0.312237

In [27]:
A = np.zeros(3, dtype=[('A','i8'), ('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [28]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [30]:
data1 = pd.Series([0.25,0.35,0.50,0.75], index=['a','b','c','d'])
data1

a    0.25
b    0.35
c    0.50
d    0.75
dtype: float64

In [31]:
data1['c']

0.5

In [34]:
data['a':'c'

SyntaxError: unexpected EOF while parsing (<ipython-input-34-270477da9a1f>, line 1)

In [35]:
# slicing by explicit index
data1['a':'c']

a    0.25
b    0.35
c    0.50
dtype: float64

In [36]:
# slicing by implicit integer index
data1[0:2]

a    0.25
b    0.35
dtype: float64

In [39]:
# masking
data1[(data1 >0.3) & (data1 < 0.40)]

b    0.35
dtype: float64

In [40]:
# fancy indexing
data1[['a','c']]

a    0.25
c    0.50
dtype: float64

In [41]:
data

2.2    0.21
3.1    0.54
4.0    0.75
5.0    0.65
dtype: float64

In [1]:
import pandas as pd
marks1 = {'Sagar':45, 'Hitesh': 55, 'Taral': 60, 'Pukraj': 50, 'Shreyashi': 60, 'Pratik': 68}
marks2 = {'Sagar':55, 'Hitesh': 82, 'Taral': 64, 'Pukraj': 71, 'Shreyashi': 67, 'Pratik': 58}
marks3 = {'Sagar':78, 'Hitesh': 79, 'Taral': 82, 'Pukraj': 48, 'Shreyashi': 67, 'Pratik': 49}
students = pd.DataFrame({'marks1':marks1, 'marks2':marks2, 'marks3':marks3,})
students

           marks1  marks2  marks3
Hitesh         55      82      79
Pratik         68      58      49
Pukraj         50      71      48
Sagar          45      55      78
Shreyashi      60      67      67
Taral          60      64      82

In [45]:
students['marks2']

Hitesh       82
Pratik       58
Pukraj       71
Sagar        55
Shreyashi    67
Taral        64
Name: marks2, dtype: int64

In [46]:
students['total'] = students['marks1'] + students['marks2'] + students['marks3']
students

           marks1  marks2  marks3  total
Hitesh         55      82      79    216
Pratik         68      58      49    175
Pukraj         50      71      48    169
Sagar          45      55      78    178
Shreyashi      60      67      67    194
Taral          60      64      82    206

In [47]:
students['average'] = students['marks1'] + students['marks2'] + students['marks3'] / 3
students

           marks1  marks2  marks3  total     average
Hitesh         55      82      79    216  163.333333
Pratik         68      58      49    175  142.333333
Pukraj         50      71      48    169  137.000000
Sagar          45      55      78    178  126.000000
Shreyashi      60      67      67    194  149.333333
Taral          60      64      82    206  151.333333

In [48]:
students['Percentage'] = ((students['total'] /300) * 100)
students

           marks1  marks2  marks3  total     average  Percentage
Hitesh         55      82      79    216  163.333333   72.000000
Pratik         68      58      49    175  142.333333   58.333333
Pukraj         50      71      48    169  137.000000   56.333333
Sagar          45      55      78    178  126.000000   59.333333
Shreyashi      60      67      67    194  149.333333   64.666667
Taral          60      64      82    206  151.333333   68.666667

In [50]:
students.iloc[:3,:2]

        marks1  marks2
Hitesh      55      82
Pratik      68      58
Pukraj      50      71

In [51]:
students.loc[:'Sagar',:'total']

        marks1  marks2  marks3  total
Hitesh      55      82      79    216
Pratik      68      58      49    175
Pukraj      50      71      48    169
Sagar       45      55      78    178

In [56]:
students.ix[:4,:'average']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

        marks1  marks2  marks3  total     average
Hitesh      55      82      79    216  163.333333
Pratik      68      58      49    175  142.333333
Pukraj      50      71      48    169  137.000000
Sagar       45      55      78    178  126.000000

In [7]:
import numpy as np
value1 = np.random.randint(10000,100000,(5,2))

pop = pd.DataFrame(value1, index = ['UYGU','khukihb','uygug','ufut','iyg'], columns=['area','population'])
pop

          area  population
UYGU     33823       58248
khukihb  11334       41965
uygug    79068       85122
ufut     50255       85626
iyg      91574       97117